app/controllers/api/v1/billings_controller.rb

SELECT  "billings".* FROM "billings" WHERE "billings"."slug" = $1 LIMIT $2  [["slug", "\"4np-x-0001-00016945\""], ["LIMIT", 1]]
---
  def state
    if params[:invoice].present? && params[:invoice][:slug].present?
      billing = Billing.find_by(slug: params[:invoice][:slug])